InformationRegisters/НастройкиВызоваМетодовGPT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВызоваМетодовGPT</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньКреативности</Name>
					<Comment>temperature - может принимать значение от 0 до 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВариантовОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МетодыGPT</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиВызоваМетодовGPT/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает настройку обращения к методу GPT
//
// Параметры:
//	Метод - СправочникСсылка.МетодыGPT - Ссылка на метод
//
// Возвращаемое значение:
//	Структура - Настройки вызова метода
//
Функция НастройкаМетода(Метод) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиВызоваМетодовGPT.АдресРесурса КАК АдресРесурса,
	                      |	НастройкиВызоваМетодовGPT.Модель КАК Модель,
	                      |	НастройкиВызоваМетодовGPT.Таймаут КАК Таймаут,
	                      |	НастройкиВызоваМетодовGPT.УровеньКреативности КАК УровеньКреативности,
	                      |	НастройкиВызоваМетодовGPT.КоличествоВариантовОтвета КАК КоличествоВариантовОтвета
	                      |ИЗ
	                      |	РегистрСведений.НастройкиВызоваМетодовGPT КАК НастройкиВызоваМетодовGPT
	                      |ГДЕ
	                      |	НастройкиВызоваМетодовGPT.Используется
	                      |	И НастройкиВызоваМетодовGPT.Метод = &Метод");
	
	Запрос.УстановитьПараметр("Метод", Метод);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда		
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Настройка = СтруктураНастройки();
	ЗаполнитьЗначенияСвойств(Настройка, Выборка);
	
	Возврат Настройка;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураНастройки()
	
	Настройка = Новый Структура;
	Настройка.Вставить("АдресРесурса", "");
	Настройка.Вставить("Модель", "");
	Настройка.Вставить("Таймаут", "");
	Настройка.Вставить("УровеньКреативности", 0); 
	Настройка.Вставить("КоличествоВариантовОтвета", 0);
	
	Возврат Настройка;
	
КонецФункции

#КонецОбласти
